def area(a, b):
    ''' Возвращает площадь прямоугольника
            Параметры:
                a (number): первая сторона прямоугольника
                b (number): вторая сторона прямоугольника
            Возвращаемое значение:
                area (number): площадь прямоугольника
    '''

    return a * b

def perimeter(a, b):
    ''' Возвращает периметр прямоугольника
            Параметры:
                a (number): первая сторона прямоугольника
                b (number): вторая сторона прямоугольника
            Возвращаемое значение:
                perimeter (number): периметр прямоугольника
    '''

    return a * 2 + b * 2
