def area(a, h):
    ''' Возвращает площадь треугольника
            Параметры:
                a (number): сторона треугольника
                h (number): высота, проведенная к этой стороне
            Возвращаемое значение:
                area (number): площадь треугольника
    '''

    return a * h / 2

def perimeter(a, b, c):
    ''' Возвращает периметр треугольника
            Параметры:
                a (number): сторона треугольника
                b (number): сторона треугольника
                c (number): сторона треугольника
            Возвращаемое значение:
                perimeter (number): периметр треугольника
    '''

    return a + b + c